{
  "ingest_source": {
    "id": "f3324334-97d4-42a2-86d1-fd459b273ba6",
    "source_type": "evernote_html",
    "source_path": "/Users/tang/workbench/article-classifier/backups/2023年6月/IT技术/无标题笔记-12.html",
    "collected_at": "2025-11-09T20:05:15.071040Z",
    "external_id": null,
    "title_hint": null,
    "language_hint": "en",
    "captured_at": null,
    "checksum": "568336565df8e02d1339ceb47213026771ca1c8a7b6d0b48b86c4b65ab66969a",
    "status": "pending",
    "notes": {
      "batch_id": null
    }
  },
  "note": {
    "id": "d87e9b55-a516-4b70-843f-81f39cfa06d8",
    "ingest_source_id": "f3324334-97d4-42a2-86d1-fd459b273ba6",
    "canonical_title": "无标题笔记-12",
    "language": "en",
    "ingested_at": "2025-11-09T20:05:15.071043Z",
    "created_at": null,
    "status": "active",
    "importance": 0,
    "attributes": {
      "source_filename": "无标题笔记-12.html"
    }
  },
  "variants": [
    {
      "id": "f36cb2fb-79fa-4cf7-b6d2-435c60dbd6af",
      "note_id": "d87e9b55-a516-4b70-843f-81f39cfa06d8",
      "variant_type": "raw_html",
      "version": 1,
      "created_by": "evernote_ingest:v0",
      "created_at": "2025-11-09T20:05:15.071046Z",
      "content": "---\ntitle: 无标题笔记\nupdated: 2018-05-15 00:06:01Z\ncreated: 2018-05-15 00:06:01Z\n---\n\n\n<en-note><div>SUPREME COURT<br CLEAR=\"none\"/>MAY 14, 2018 / 10:12 PM / UPDATED 2 HOURS AGO<br CLEAR=\"none\"/>U.S. high court paves way for states to legalize sports betting<br CLEAR=\"none\"/>Lawrence Hurley<br CLEAR=\"none\"/>WASHINGTON (Reuters) - The U.S. Supreme Court on Monday paved the way for states to legalize sports gambling, striking down a 1992 federal law that barred it in most places and setting off a rush by businesses and states to cash in on an expected multibillion-dollar jackpot.<div><br CLEAR=\"none\"/></div><div><br CLEAR=\"none\"/></div>The justices endorsed New Jersey&rsquo;s bid to allow such wagering in a ruling that ushers in a new era for the leading U.S. sports leagues, which had sued to block the state&rsquo;s sports gambling law and called such betting a threat to the integrity of competition, fearing game-fixing and other types of cheating.<div><br CLEAR=\"none\"/></div>In a ruling that sent shares in gaming companies and casinos soaring, the court voided the federal Professional and Amateur Sports Protection Act and upheld the legality of a 2014 state law permitting sports betting at New Jersey casinos and horse racetracks.<div><br CLEAR=\"none\"/></div>Some states see sports betting, like lotteries, as a potentially lucrative source of tax revenue. The American Gaming Association estimates there is currently a $150 billion-a-year illegal sports-betting market.<div><br CLEAR=\"none\"/></div>The ruling takes the United States a step closer to legal sports betting in numerous states, perhaps nationwide, rather than just in select places such as Nevada, home to the gambling capital Las Vegas. The 1992 law had effectively prohibited sports gambling in all states except Nevada and, to a limited extent, Delaware, Montana and Oregon.<div><br CLEAR=\"none\"/></div>&ldquo;New Jersey has long been the lead advocate in fighting this inherently unequal law, and today&rsquo;s ruling will finally allow for authorized facilities in New Jersey to take the same bets that are legal in other states in our country,&rdquo; New Jersey Governor Phil Murphy, a Democrat, said in a statement.<div><br CLEAR=\"none\"/></div>The ruling adds to a decades-long trend of decreased restrictions on various types of gambling in the United States.<div><br CLEAR=\"none\"/></div>The news ignited a rally in gaming stocks, sending several to record highs. Those specializing in gambling technology gained 10 percent or more. Shares of Scientific Games Corp, which develops gaming systems and sports-betting technology, jumped more than 11 percent to a record high close.<div><br CLEAR=\"none\"/></div>A television journalists reports on a decision that was released allowing the legalization of sports betting at the Supreme Court in Washington, U.S., May 14, 2018. REUTERS/Joshua Roberts<br CLEAR=\"none\"/>Shares of casino and racing facility operators also rose. Churchill Downs, which operates the Kentucky Derby, rose 4.9 percent to a record high, while Penn National Gaming climbed 4.7 percent, also to a record. Caesars Entertainment Corp rose 5.5 percent.<div><br CLEAR=\"none\"/></div>The U.S. subsidiary of British sports betting operator William Hill PLC, which has already been working with state officials in New Jersey on opening an outlet at Monmouth Park racetrack, is one of the companies hoping to capitalize. The shares in the company, which derives nearly 20 percent of annual revenue from the United States, jumped nearly 11 percent in London trading.<div><br CLEAR=\"none\"/></div>The Supreme Court agreed with New Jersey&rsquo;s argument that the federal law infringed upon state sovereignty as laid out in the U.S. Constitution by compelling states not to license or regulate sports betting.<div><br CLEAR=\"none\"/></div>&lsquo;POLICY CHOICE&rsquo;<br CLEAR=\"none\"/>The justices struck down the entire federal law on a 6-3 vote, with the court&rsquo;s five conservatives joined by liberal Elena Kagan. Lower courts had ruled against New Jersey&rsquo;s law.<div><br CLEAR=\"none\"/></div>&ldquo;The legalization of sports gambling requires an important policy choice, but the choice is not ours to make. Congress can regulate sports gambling directly, but if it elects not to do so, each state is free to act on its own,&rdquo; Justice Samuel Alito wrote on behalf of the court.<div><br CLEAR=\"none\"/></div>Legal experts predicted that sports leagues and players&rsquo; unions, as well as dozens of states, will seek a cut of the revenue from expanded sports gambling.<div><br CLEAR=\"none\"/></div>In addition to New Jersey, five other states - Connecticut, Mississippi, New York, Pennsylvania and West Virginia - already have sports betting laws in place that would allow them to move quickly, according to a Fitch Ratings report.<div><br CLEAR=\"none\"/></div>New Jersey&rsquo;s law, championed by Republican former Governor Chris Christie, was challenged in court by the National Football League, Major League Baseball, the National Basketball Association, the National Hockey League and the National Collegiate Athletic Association, the major governing body for intercollegiate sports.<div><br CLEAR=\"none\"/></div>The decision may prompt the U.S. Congress to consider legislation to regulate sports betting nationally, a move the National Football League said it would welcome.<div><br CLEAR=\"none\"/></div><div><br CLEAR=\"none\"/></div><div><br CLEAR=\"none\"/></div><div><br CLEAR=\"none\"/></div>Slideshow (2 Images)<br CLEAR=\"none\"/>&ldquo;Congress has long recognized the potential harms posed by sports betting to the integrity of sporting contests and the public confidence in these events. Given that history, we intend to call on Congress again, this time to enact a core regulatory framework for legalized sports betting,&rdquo; the NFL said in a statement.<div><br CLEAR=\"none\"/></div>Republican Senator Orrin Hatch said he would introduce legislation to &ldquo;establish fundamental standards for sports betting&rdquo; and allow states to decide whether or not to legalize it.<div><br CLEAR=\"none\"/></div>Professional sports leagues have begun to shift their views regarding sports betting. Las Vegas now has an NHL team and will soon have an NFL team, and the NBA&rsquo;s commissioner has called for legalizing sports betting so it can be properly regulated.<div><br CLEAR=\"none\"/></div>Geoff Freeman, president of the American Gaming Association, said his group will work with states, sports leagues and law enforcement &ldquo;to create a new regulatory environment that capitalizes on this opportunity to engage fans and boost local economies.&rdquo;<div><br CLEAR=\"none\"/></div>Daily fantasy sports company DraftKings Inc said it is weighing entering the sports betting business following the decision.<div><br CLEAR=\"none\"/></div>New Jersey&rsquo;s law allows people age 21 and above to bet on sports at New Jersey casinos and racetracks, but would ban wagers on college teams based in or playing in the state.<div><br CLEAR=\"none\"/></div>Reporting by Lawrence Hurley; Additional reporting by Andrew Chung, Hilary Russ, Frank Pingue, Dan Burns and Sinead Carew; Editing by Will Dunham<div><br CLEAR=\"none\"/></div>Our Standards:The Thomson Reuters Trust Principles.<br CLEAR=\"none\"/>AppsNewslettersReuters PlusAdvertising GuidelinesCookiesTerms of UsePrivacy<br CLEAR=\"none\"/>All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.<div><br CLEAR=\"none\"/></div>&copy; 2018 Reuters. All Rights Reserved.<div><br CLEAR=\"none\"/></div>&times;<br CLEAR=\"none\"/>Real news for busy people.<div><br CLEAR=\"none\"/></div>GET THE APP</div></en-note>      ",
      "content_path": null,
      "diff_base_variant_id": null,
      "metadata": {
        "checksum": "568336565df8e02d1339ceb47213026771ca1c8a7b6d0b48b86c4b65ab66969a",
        "path": "/Users/tang/workbench/article-classifier/backups/2023年6月/IT技术/无标题笔记-12.html"
      }
    },
    {
      "id": "20ccd55b-c253-4533-ad73-7a9304e3ec3d",
      "note_id": "d87e9b55-a516-4b70-843f-81f39cfa06d8",
      "variant_type": "clean_text",
      "version": 1,
      "created_by": "evernote_ingest:v0",
      "created_at": "2025-11-09T20:05:15.071048Z",
      "content": "---\ntitle: 无标题笔记\nupdated: 2018-05-15 00:06:01Z\ncreated: 2018-05-15 00:06:01Z\n---\n\nSUPREME COURT\nMAY 14, 2018 / 10:12 PM / UPDATED 2 HOURS AGO\nU.S. high court paves way for states to legalize sports betting\nLawrence Hurley\nWASHINGTON (Reuters) - The U.S. Supreme Court on Monday paved the way for states to legalize sports gambling, striking down a 1992 federal law that barred it in most places and setting off a rush by businesses and states to cash in on an expected multibillion-dollar jackpot.\nThe justices endorsed New Jersey’s bid to allow such wagering in a ruling that ushers in a new era for the leading U.S. sports leagues, which had sued to block the state’s sports gambling law and called such betting a threat to the integrity of competition, fearing game-fixing and other types of cheating.\nIn a ruling that sent shares in gaming companies and casinos soaring, the court voided the federal Professional and Amateur Sports Protection Act and upheld the legality of a 2014 state law permitting sports betting at New Jersey casinos and horse racetracks.\nSome states see sports betting, like lotteries, as a potentially lucrative source of tax revenue. The American Gaming Association estimates there is currently a $150 billion-a-year illegal sports-betting market.\nThe ruling takes the United States a step closer to legal sports betting in numerous states, perhaps nationwide, rather than just in select places such as Nevada, home to the gambling capital Las Vegas. The 1992 law had effectively prohibited sports gambling in all states except Nevada and, to a limited extent, Delaware, Montana and Oregon.\n“New Jersey has long been the lead advocate in fighting this inherently unequal law, and today’s ruling will finally allow for authorized facilities in New Jersey to take the same bets that are legal in other states in our country,” New Jersey Governor Phil Murphy, a Democrat, said in a statement.\nThe ruling adds to a decades-long trend of decreased restrictions on various types of gambling in the United States.\nThe news ignited a rally in gaming stocks, sending several to record highs. Those specializing in gambling technology gained 10 percent or more. Shares of Scientific Games Corp, which develops gaming systems and sports-betting technology, jumped more than 11 percent to a record high close.\nA television journalists reports on a decision that was released allowing the legalization of sports betting at the Supreme Court in Washington, U.S., May 14, 2018. REUTERS/Joshua Roberts\nShares of casino and racing facility operators also rose. Churchill Downs, which operates the Kentucky Derby, rose 4.9 percent to a record high, while Penn National Gaming climbed 4.7 percent, also to a record. Caesars Entertainment Corp rose 5.5 percent.\nThe U.S. subsidiary of British sports betting operator William Hill PLC, which has already been working with state officials in New Jersey on opening an outlet at Monmouth Park racetrack, is one of the companies hoping to capitalize. The shares in the company, which derives nearly 20 percent of annual revenue from the United States, jumped nearly 11 percent in London trading.\nThe Supreme Court agreed with New Jersey’s argument that the federal law infringed upon state sovereignty as laid out in the U.S. Constitution by compelling states not to license or regulate sports betting.\n‘POLICY CHOICE’\nThe justices struck down the entire federal law on a 6-3 vote, with the court’s five conservatives joined by liberal Elena Kagan. Lower courts had ruled against New Jersey’s law.\n“The legalization of sports gambling requires an important policy choice, but the choice is not ours to make. Congress can regulate sports gambling directly, but if it elects not to do so, each state is free to act on its own,” Justice Samuel Alito wrote on behalf of the court.\nLegal experts predicted that sports leagues and players’ unions, as well as dozens of states, will seek a cut of the revenue from expanded sports gambling.\nIn addition to New Jersey, five other states - Connecticut, Mississippi, New York, Pennsylvania and West Virginia - already have sports betting laws in place that would allow them to move quickly, according to a Fitch Ratings report.\nNew Jersey’s law, championed by Republican former Governor Chris Christie, was challenged in court by the National Football League, Major League Baseball, the National Basketball Association, the National Hockey League and the National Collegiate Athletic Association, the major governing body for intercollegiate sports.\nThe decision may prompt the U.S. Congress to consider legislation to regulate sports betting nationally, a move the National Football League said it would welcome.\nSlideshow (2 Images)\n“Congress has long recognized the potential harms posed by sports betting to the integrity of sporting contests and the public confidence in these events. Given that history, we intend to call on Congress again, this time to enact a core regulatory framework for legalized sports betting,” the NFL said in a statement.\nRepublican Senator Orrin Hatch said he would introduce legislation to “establish fundamental standards for sports betting” and allow states to decide whether or not to legalize it.\nProfessional sports leagues have begun to shift their views regarding sports betting. Las Vegas now has an NHL team and will soon have an NFL team, and the NBA’s commissioner has called for legalizing sports betting so it can be properly regulated.\nGeoff Freeman, president of the American Gaming Association, said his group will work with states, sports leagues and law enforcement “to create a new regulatory environment that capitalizes on this opportunity to engage fans and boost local economies.”\nDaily fantasy sports company DraftKings Inc said it is weighing entering the sports betting business following the decision.\nNew Jersey’s law allows people age 21 and above to bet on sports at New Jersey casinos and racetracks, but would ban wagers on college teams based in or playing in the state.\nReporting by Lawrence Hurley; Additional reporting by Andrew Chung, Hilary Russ, Frank Pingue, Dan Burns and Sinead Carew; Editing by Will Dunham\nOur Standards:The Thomson Reuters Trust Principles.\nAppsNewslettersReuters PlusAdvertising GuidelinesCookiesTerms of UsePrivacy\nAll quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays.\n© 2018 Reuters. All Rights Reserved.\n×\nReal news for busy people.\nGET THE APP",
      "content_path": null,
      "diff_base_variant_id": null,
      "metadata": {
        "language": "en",
        "length": 6480,
        "rule_count": 0,
        "applied_rules": []
      }
    }
  ],
  "extractions": [],
  "journal": {
    "id": "60390ef6-7556-4a15-8ed9-41adb3cd4b7b",
    "note_id": "d87e9b55-a516-4b70-843f-81f39cfa06d8",
    "stage": "ingest",
    "agent_id": "evernote_ingest:v0",
    "started_at": "2025-11-09T20:05:15.071053Z",
    "finished_at": "2025-11-09T20:05:15.071054Z",
    "status": "success",
    "input_ref": {
      "task_id": "88bbff00-6b95-4c43-8cc3-89be1ef4ec50",
      "source_path": "/Users/tang/workbench/article-classifier/backups/2023年6月/IT技术/无标题笔记-12.html",
      "checksum": "568336565df8e02d1339ceb47213026771ca1c8a7b6d0b48b86c4b65ab66969a"
    },
    "output_ref": {
      "ingest_source": "f3324334-97d4-42a2-86d1-fd459b273ba6",
      "note": "d87e9b55-a516-4b70-843f-81f39cfa06d8",
      "variants": [
        "f36cb2fb-79fa-4cf7-b6d2-435c60dbd6af",
        "20ccd55b-c253-4533-ad73-7a9304e3ec3d"
      ]
    },
    "error_detail": null
  }
}