---
title: Sehr heißer Tag 炎热的一天
updated: 2020-06-26 15:09:13Z
created: 2020-06-26 12:46:10Z
author: tangyongfeng@gmail.com
tags:
  - 小猪佩奇
---


<en-note STYLE="zoom: 1.143822;"><div>Ich bin Peppa Wutz , Das ist mein kleiner Bruder Schorsch. Das ist Mama Wutz, und das ist Papa Wutz.</div><div><br/></div><div>B: &nbsp;Die sonne scheint , Es ist ein sehr hei&szlig;er Tag.</div><div>M: Was f&uuml;r ein sch&ouml;ner hei&szlig;er Tag !</div><div>B: Peppa und Schorsch tagen Gummistiefel. Sie wollen durch die Matschepf&uuml;tzen &nbsp;springen.</div><div>P: Ich liebe Matschpampe.</div><div>B: Oje ,die sonne brennt so hei&szlig;er ,dass alle Pf&uuml;tzen ausgetrocknet &nbsp;sind .</div><div>P: Mama ,Papa, die Pf&uuml;tzen sind all hart. &nbsp;Wir k&ouml;nnen nicht mehr einspringen .</div><div>M: Nicht schlimm ,Peppa. Es ist heute so warm, ihr k&ouml;nnt stattdessen im Planschbecken baden.</div><div>P: Das Planschbecken toll !</div><div>M: Zieht erst mal eure Badeanz&uuml;gen an.</div><div>P: Ja ,Mama</div><div>B: Peppa und Schorsch tagen ihre Badeanz&uuml;ge .Mama Wutz tr&auml;ge ihren Bikini. Papa Wutz tr&auml;ge seine Badehose.</div><div>M: Die Sonne brennt so hei&szlig;, ihr braucht Sonnen creme.</div><div>P: &Ouml; ,Das ist &Ouml;lig und ekelig.</div><div>Pa: hohoho, macht nicht so ein Theater.</div><div>M: Ja ,Wir m&uuml;ssen uns all cremen.</div><div>Pa: Los komm , Schorsch. Pumpen wir Luft ins Planschbecken .</div><div>B: Papa Wutz pumpt Luft ins Planschbecken. Peppa h&auml;lt den Schlauch und Mama Wutz dreht den Hahn auf.</div><div>Pa: Babyeierlecht.</div><div>P: Wo bleibt das Wasser ?</div><div>B: im Planschbecken ist es einfach herrlich.</div><div>M&ouml;: &nbsp;Eis creme , eis creme.</div><div>P: Frau M&ouml;mel ,die Eiscreme Frau.</div><div>B: An sehr hei&szlig;en Tagen verkauft Frau M&ouml;mel Eiscreme.&nbsp;</div><div>P : Mama, Papa kriegen Schorsch und ein Eis?</div><div>Ma: Ja Klar , Schlie&szlig;lich ist heute ein besonders hei&szlig;er Tag.</div><div>P: Wa&nbsp;</div><div>Pa : Bringt ihr mir auch ein Eis mit.</div><div>B: Alle m&ouml;gen eis creme.</div><div>M&ouml;: Hallo Mama Wutz, Peppa und Schorsch .</div><div>M: Hallo Frau M&ouml;mmel.</div><div>M&ouml;: Was h&auml;ttet ihr denn gerne?</div><div>P: Kann ich bitte ein H&ouml;rnchen eis haben?</div><div>M&ouml;: aber nat&uuml;rlich Peppa.</div><div>P: Danke</div><div>M: Dasselbe f&uuml;r mich und f&uuml;r Papa Wutz bitte.</div><div>M&ouml;: Und was darf es f&uuml;r den kleinen Schorsch sein.</div><div>S: Saurier.</div><div>M&ouml;: ein Saurier :</div><div>P: Dummer Schorsch , Saurier ist das ein zige Wort , das Schorsch sagen kann.</div><div>M&ouml; :Tja ,zufallieger Weise habe ich gerdade ein Saurier Eis f&uuml;r dich dabei.</div><div>S: Saurier.</div><div>M: Schorsch, nun isst mal dein Eis bevor schmelzt.</div><div>B: Schorsch findet das Saurier so sch&ouml;n, dass er es nicht essen will.</div><div>M: Danke sehr , Frau M&ouml;mel.</div><div>M&ouml; : Genie&szlig;t das Wetter.</div><div>M: Schorsch, du solltest dein Saurier Eis jetzt wirklich essen bevor schmelzt zu Boden f&auml;llt.</div><div>B: Oje, Schorsch Saurier Eis ist geschmolzen und runtergefallen .</div><div>M : Weine doch nicht, Schorsch. Papa gibt dir von seinen H&ouml;rnchen eis bestimmt gerne was ab.</div><div><br/></div><div>B: Das ist so hei&szlig; , dass Papa Wutz einschlafen ist.</div><div>M: Papa Wutz sieht erhitzt aus .</div><div>P: Wir spritzen wasser auf Papa , dann k&uuml;hlt er ab.</div><div><br/></div><div>M: gute idea .Peppa.</div><div>M: du warst ganz rot und hei&szlig; Papa Wutz.</div><div>P: Wir haben dich mit Wasser gespritzt.</div><div>Pa : oh , verstehe . danke &nbsp;Peppa.</div><div>P: Schaut , die Pf&uuml;tzen . Los Schorsch , wir holen die Stiefel.</div><div><br/></div><div>B: Peppa und Schorsch tragen ihre Gummistiefel.</div><div><br/></div><div>B: Peppa und Schorsch m&ouml;gen hei&szlig;e Tage. Aber noch lieber m&ouml;gen sie Pf&uuml;tzen.</div><div><br/></div><div><br/></div><div>&nbsp;</div><div><br/></div><div><br/></div><div><br/></div><div><br/></div><div><br/></div></en-note>      