---
title: Gespräch über ein Thema "Gruppenreisen"
updated: 2020-11-26 11:22:29Z
created: 2020-11-24 11:53:15Z
author: tangyongfeng@gmail.com
---


<en-note><div><br/></div><div>Sabine Kostermann , Sie ist 33 Jahre alt .Sie ist B&uuml;rokauffrau.</div><div><br/></div><div>Sie ist der Meinung , dass sie gern in einer Gruppe verreist. Allein reisen macht ihr keinen Spa&szlig;.Bei Gruppenreisen kann man neue Leute kennen lernen und hat immer Gesellschaft. Au&szlig;erdem ist ein Reisef&uuml;hrer dabei, der einem die Sehensw&uuml;rdigkeiten zeigt.</div><div><br/></div><div>ich bin nicht ihre Meinung. Ich liebe allein Reisen, kann man immer ausschlafen. Wenn man in eine Gruppe verreist, muss man oft fr&uuml;h &nbsp;aufstehen. wenn ich allein reiste, kann ich selbst eine pass Plan machen. Ich denke , dass die Reise bestimmt frei und &nbsp;e<span STYLE="font-size: 14.7px; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: rgb(255, 255, 255); color: rgb(50, 81, 125); font-family: helvetica, 宋体, arial, sans-serif; font-variant-caps: normal; font-variant-ligatures: normal;">ntspannt</span>&nbsp;f&uuml;r mich ist . wenn man immer mit einer Gruppe zusammen eine Reise teilnimmt &nbsp;hat , dann man immer keine selbst Zeit hat.&nbsp;</div><div><br/></div><div>Lassen Sie mich meine Erfahrungen teilen. am 2008 habe ich im internet g&uuml;nstige Flugticket nach Seattle gefunden, die Ticket koste ca. 400 Euro Sonderangebot ,dann habe ich spontan gebucht. Wenn ich die Abreise wusste habe, ist es erste &nbsp;Flug nach Seattle von der Fluglinie, das fangt eine Gluck an.</div><div><br/></div><div>Im Flugzeug habe ich viele &Uuml;beraschung bekommt, zB. im Flugzeug hat die Stewardess sehr sch&ouml;ne Lieder &nbsp;f&uuml;r uns gesungen, und als G&auml;ste haben wir viele Geschenke jeden Stunden bekommt. besondere &Uuml;berraschung ist &nbsp; Einkarte von NBA , natulich &nbsp;bin ich &nbsp;auch NBAs Fans ,ich m&ouml;chte auch dieser super Chance bekommen , aber leider habe ich endlich keine Einkarte bekommt. nach 12 Stunden hat Flugzeugen auf dem Seattle Flughafen gekommen.</div><div><br/></div><div>Als das Flugzeug hat gelandet, der Flughafen hat Regenbogen mit wasserspitzer gemachter, weil es erster Ankunft der Fluglinie war.</div><div><br/></div><div>Am n&auml;chsten Tag habe ich Boeing Museum besucht , es ist sehr riesig .&nbsp;</div><div><br/></div><div>Ich interessiere mich f&uuml;r Flugzeuge von seit 20 Jahren , Im dieser Boeing Museum hat &nbsp;viele wirklich Flugzeuge &nbsp;und Modell&nbsp;ausgestellt.</div><div><br/></div><div>&nbsp;Gibt es &nbsp;die h&ouml;chsten &nbsp;&quot;Blackbird&quot; ,&auml;lteste und neueste Flugzeugmodell ,und im Boeing Museum habe ich unerwartet wirklich der F14 und &nbsp;F18 Flugzeuge gesehen.Das ist gl&uuml;cklich f&uuml;r mich , weil man beider Flugzeugen wenig im Museum besuchen kann.</div><div><br/></div><div>Ich interessiere mich sehr f&uuml;r Flugzeuge. Mein Plan war es ,dass dieses Museum f&uuml;r eine Tage besucht, &nbsp;aber dieses Museum wirklich toll ist ,dann habe ich meine Plan vor&uuml;bergehend ge&auml;ndert und das Museum &uuml;ber drei Tage besucht.und es ist unm&ouml;glich, meinen plan vor&uuml;bergehend zu &auml;ndern, wenn ich mit eine Gruppe reise.</div><div><br/></div><div>W&auml;hrend dieser Reise erlebte ich USA &ouml;ffentliche Verkehrsmittel, weil ich in dieser Reise oft mit dem Bus von Hotel zu Stadt gefahren habe. Das Busticket ist nicht teuer , aber Busfahrer meldete keine Station, ich kann immer Station verfahren.aber das ist keine Problem, wenn ich eine Station verfahre ,dann kann ich neue Ort besuchen.&nbsp;</div><div><br/></div><div>das w&auml;re ich alleine Reise , habe ich viele Spa&szlig; gemacht. bis heute finde ich auch sehr Gl&uuml;ck von diese Reise.</div><div>Das ist wichtig &nbsp;,wenn man &nbsp;in der Reise etwas sehen oder ,was man &nbsp;entscheiden oder wie lange man an eine Ort bleibe kann.</div></en-note>      