---
title: Gespräch über ein Thema "Gruppenreisen"
updated: 2020-12-02 12:05:17Z
created: 2020-12-01 12:14:52Z
author: tangyongfeng@gmail.com
tags:
  - B1
  - 考前冲刺
---


<en-note><div>Sabine Kostermann  ist 33 Jahre alt. Sie ist B&uuml;rokauffrau.</div><div><br/></div><div>Sie ist der Meinung, dass sie gern in einer Gruppe&nbsp;reist. Allein reisen macht ihr keinen Spa&szlig;. Bei Gruppenreisen kann man neue Leute kennenlernen und hat immer Gesellschaft. Au&szlig;erdem ist ein Reisef&uuml;hrer dabei, der einem die Sehensw&uuml;rdigkeiten zeigt.
</div><div><br/></div><div>Ich bin nicht ihrer Meinung. Ich liebe, allein zu reisen, weil  man immer ausschlafen kann. Wenn man in einer Gruppe reist, muss man oft fr&uuml;h aufstehen. Wenn ich allein reise, kann ich selbst einen passenden Plan machen. Ich denke, dass eine Reise frei und &nbsp;entspannt f&uuml;r mich sein soll . Wenn man mit einer Gruppe zusammen an einer Reise teilnimmt , dann man immer keine Zeit f&uuml;r sich. 
</div><div><br/></div><div>Lassen Sie mich meine Erfahrungen teilen. 2008 habe ich im Internet ein g&uuml;nstiges Flugticket nach Seattle gefunden. Das Ticket kostete ca. 400 Euro , dann habe ich spontan gebucht. Wenn ich die Abreise wusste habe, ist es erste &nbsp;Flug nach Seattle von der Fluglinie, das fangt eine Gluck an. </div><div><br/></div><div>Im Flugzeug habe ich viele &Uuml;berraschungen erlebt, z.B. im Flugzeug hat die Stewardess sehr sch&ouml;ne Lieder f&uuml;r uns gesungen, und als G&auml;ste haben wir viele Geschenke jede<span STYLE="text-decoration: line-through;"> </span>Stunden bekomm. Eine besondere &Uuml;berraschung war die Eintrittskarte  f&uuml;r ein NBA Spiel. Nat&uuml;rlich bin ich auch NBA Fan. Ich wollte auch dieser super Chance bekommen, aber leider habe ich  sie nicht bekommen. Nach 12 Stunden ist das Flugzeugen auf dem Seattle Flughafen gelandet.
</div><div><br/></div><div>Als das Flugzeug gelandet ist, hat der Flughafen einen Regenbogen mit Wasserwerfer gemacht, weil es die erste Ankunft der Fluglinie war.</div><div><br/></div><div>Am n&auml;chsten Tag habe ich das Boeing Museum besucht , es ist riesig . 
</div><div><br/></div><div>Ich interessiere mich f&uuml;r Flugzeuge seit 20 Jahren. Im diesem Boeing Museum  sind&nbsp; viele echte Flugzeuge, aber auch  Modelle ausgestellt.
</div><div><br/></div><div> Es gibt die h&ouml;chsten  &quot;Blackbird&quot;, die &auml;ltesten und neuesten Flugzeugmodelle und im Boeing Museum habe ich unerwartet eine echte F14 und &nbsp;F18 gesehen. Ich kann sogar in den F18 sitzen ! Das  war ein Gl&uuml;ck f&uuml;r mich, weil man beide Flugzeugen nur selten im Museum besichtigen kann.
</div><div><br/></div><div>Ich interessiere mich sehr f&uuml;r Flugzeuge. Mein Plan war es, dass dieses Museum f&uuml;r eine Tage zu besuch, aber dieses Museum war wirklich toll ,  deshalb habe ich meine Plan &nbsp;kurzfristig ge&auml;ndert und das Museum &uuml;ber drei Tage besucht. es  w&auml;re unm&ouml;glich gewesen, meinen Plan kurzfristig zu &auml;ndern, wenn ich mit eine Gruppe gereist w&auml;re.
</div><div><br/></div><div>W&auml;hrend dieser Reise erlebte ich die USA mit &ouml;ffentlichen Verkehrsmitteln, weil ich  bei dieser Reise oft mit dem Bus von Hotel  in die Stadt gefahren  bin. Das Busticket  war nicht teuer, aber der Busfahrer meldete keine Station,  man konnte  immer Station  verpassen. Aber das  war keine Problem, wenn ich eine Station  verpasset hatte, dann  konnte ich einen neuen Ort besuchen. 
</div><div><br/></div><div>Das w&auml;re ich alleine Reise, hat mir viel<span STYLE="text-decoration: line-through;">e</span> Spa&szlig; gemacht. Bis heute finde ich auch sehr Gl&uuml;ck von diese Reise.
</div><div>Das ist wichtig, wenn man  bei der Reise etwas sehen oder, was man entscheiden oder wie lange man an eine Ort bleibe kann.</div></en-note>      