{
  "ingest_source": {
    "id": "579b8970-2e74-4369-bd0a-8d5270088036",
    "source_type": "evernote_html",
    "source_path": "backups/2023年6月/IT技术/A Beginners Guide to Beating the Bookmakers with T.html",
    "collected_at": "2025-11-10T15:43:30.638447Z",
    "external_id": null,
    "title_hint": null,
    "language_hint": "en",
    "captured_at": null,
    "checksum": "d5fa1897f8b8b78824e790af83459b36ddc8033f380c20e33cb6211b924b7472",
    "status": "pending",
    "notes": {
      "batch_id": "phase2-backfill-202306"
    }
  },
  "note": {
    "id": "180406ed-abd2-4a2d-8d6b-56a30bc9d868",
    "ingest_source_id": "579b8970-2e74-4369-bd0a-8d5270088036",
    "canonical_title": "A Beginners Guide to Beating the Bookmakers with T",
    "language": "en",
    "ingested_at": "2025-11-10T15:43:30.638452Z",
    "created_at": null,
    "status": "active",
    "importance": 0,
    "attributes": {
      "source_filename": "A Beginners Guide to Beating the Bookmakers with T.html"
    }
  },
  "variants": [
    {
      "id": "afb48fb3-95ab-4789-8963-60e44465e706",
      "note_id": "180406ed-abd2-4a2d-8d6b-56a30bc9d868",
      "variant_type": "raw_html",
      "version": 1,
      "created_by": "evernote_ingest:v0",
      "created_at": "2025-11-10T15:43:30.638455Z",
      "content": "---\ntitle: A Beginners Guide to Beating the Bookmakers with TensorFlow\nupdated: 2018-02-21 14:20:03Z\ncreated: 2018-02-21 14:19:30Z\nsource: >-\n  http://andrew.carterlunn.co.uk/programming/2018/02/20/beating-the-bookmakers-with-tensorflow.html\ntags:\n  - ai\n  - tensorflow\n  - 深度学习\n---\n\n\n<en-note STYLE=\"word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space;\"><div STYLE=\"font-size: 16px\">&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <div TITLE=\"Twitter Follow Button\"></div>&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A Beginners Guide to Beating the Bookmakers with TensorFlow&nbsp;&nbsp;&nbsp; </div>&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; AddThis Sharing ButtonsShare to TwitterShare to LinkedInShare to FacebookShare to 電子郵件&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; Feb 20, 2018 &nbsp;&nbsp;&nbsp; &nbsp; Alan - It says here we should use TensorFlow. Apparently we can use a Deep Neural Network to predict the outcome of football (soccer) matches. Who wants to help me collect training data?&nbsp; Doug - I don&apos;t think you should be doing so much gambling tonight Alan.&nbsp; Alan - Gambling? Who said anything about gambling? It&apos;s not gambling if you know you&apos;re going to win? Deep Neural Networks are a foolproof system.&nbsp; Stu - It&apos;s also illegal.&nbsp; Alan - It&apos;s not illegal, it&apos;s frowned upon. Like mining bitcoin on web browsers.<img SRC=\"https://res.cloudinary.com/andrewcarteruk/image/upload/v1518980040/TensorFlow%20-%20Bookmakers/hangover-07.jpg\" ALT=\"The Scene\" WIDTH=\"85\" HEIGHT=\"28\"/>My pitch for a remake of The Hangover didn&rsquo;t go down very well, but hopefully the research I did for the script will still be useful to someone.This article explains how to use the <a SHAPE=\"rect\" HREF=\"https://www.tensorflow.org/api_docs/python/tf/estimator\">TensorFlow Estimator API</a> to create a simple Deep Neural Network (DNN) that makes predictions about football (soccer) matches. It will assume that you have <a SHAPE=\"rect\" HREF=\"https://www.tensorflow.org/install/\">installed TensorFlow</a> and are familiar with the Python language.There is a corresponding <a SHAPE=\"rect\" HREF=\"https://github.com/AndrewCarterUK/football-predictor\">GitHub repository</a> containing the complete code that will be referenced throughout.What is a Deep Neural Network (DNN)?The critical thing for a beginner to understand about a DNN model, is that it is a function. Its purpose is to map a series of input features to an output. When we train our model, we provide a large number of examples where we know all of the features and the desired output, known as the labels. By analysing how bad our model is at predicting the labels, we can use some crazy calculus to modify its neurons and make it less bad at making predictions. This type of machine learning problem, where our training data is labelled, is a supervised learning problem.Our Test DataA quick google search for &ldquo;football data&rdquo; returns a link to <a SHAPE=\"rect\" HREF=\"http://www.football-data.co.uk/englandm.php\">football-data.co.uk</a> - who would have thought?Looking only at the English Premier League results, I squished about 9 and a half seasons of data into a <a SHAPE=\"rect\" HREF=\"https://github.com/AndrewCarterUK/football-predictor/blob/master/data/book.csv\">single CSV file</a>. The file contains loads of useful fields, including goals, shots, shots on target, bookmaker odds and more. Football Data also provide a <a SHAPE=\"rect\" HREF=\"http://www.football-data.co.uk/notes.txt\">column key for the data</a>.The <a SHAPE=\"rect\" HREF=\"https://github.com/AndrewCarterUK/football-predictor/blob/master/dataset.py\">dataset.py</a> script shows how this file is loaded.The Dataset class converts the CSV data to an array of processed football results containing the following keys. Not all of the results in the dataset can be used, as there needs to have been 10 games of history for each team before the statistics can be calculated.[{&nbsp; &apos;result&apos;: &apos;H&apos;, # Could be H, D or A (for home team win, draw or away team win)&nbsp; &apos;odds-home&apos;: 1.6, # Decimal odds from Bet365 on a home team win&nbsp; &apos;odds-draw&apos;: 4.8, # Decimal odds from Bet365 on a draw&nbsp; &apos;odds-away&apos;: 6.0, # Decimal odds from Bet365 on an away team win&nbsp; &apos;home-wins&apos;: 6, # Number of wins by the home team in the last 10 games&nbsp; &apos;home-draws&apos;: 2, # Number of draws by the home team in the last 10 games&nbsp; &apos;home-losses&apos;: 2, # Number of losses by the home team in the last 10 games&nbsp; &apos;home-goals&apos;: 16, # Number of goals scored by the home team in the last 10 games&nbsp; &apos;home-opposition-goals&apos;: 12, # Number of goals scored against the home team in the last 10 games&nbsp; &apos;home-shots&apos;: 68, # Number of shots made by the home team in the last 10 games&nbsp; &apos;home-shots-on-target&apos;: 53, # Number of shots on target made by the home team in the last 10 games&nbsp; &apos;home-opposition-shots&apos;: 20, # Number of shots made against the home team in the last 10 games&nbsp; &apos;home-opposition-shots-on-target&apos;: 14, # Number of shots on target made against the home team in the last 10 games&nbsp; &apos;away-wins&apos;: 3, # Number of wins by the away team in the last 10 games&nbsp; &apos;away-draws&apos;: 4, # Number of draws by the away team in the last 10 games&nbsp; &apos;away-losses&apos;: 3, # Number of losses by the away team in the last 10 games&nbsp; &apos;away-goals&apos;: 13, # Number of goals scored by the away team in the last 10 games&nbsp; &apos;away-opposition-goals&apos;: 17, # Number of goals scored against the away team in the last 10 games&nbsp; &apos;away-shots&apos;: 32, # Number of shots made by the away team in the last 10 games&nbsp; &apos;away-shots-on-target&apos;: 13, # Number of shots on target made by the away team in the last 10 games&nbsp; &apos;away-opposition-shots&apos;: 47, # Number of shots made against the away team in the last 10 games&nbsp; &apos;away-opposition-shots-on-target&apos;: 21, # Number of shots on target made against the away team in the last 10 games]}Classification or RegressionThe next step is to look at the options available for the type of predictions our model will make. In this regard, there are two primary model types, and these are known as classification or regression models.A classification model will output a prediction that the input features match a set of classes. An example of this would be using biometric measurements to predict whether a subject was of class male or female. Here, the output from our model would be a two dimensional vector containing the probability that the subject was male and the probability that the subject was female. All classification probabilities in a prediction sum to one.A regression model outputs a continuous variable (or a vector of continuous variables). An example of this would be using house features (such as location, size and bedrooms) to predict house price.We are going to use a classification model. Our three available classes will be home win H, draw D and away win A. If the output from our model for a given set of features was [0.23, 0.65, 0.12], that would correspond to a prediction that there was a 23% chance of the home team winning, a 65% chance of a draw and a 12% chance of the away team winning.This model choice means that we will be using the <a SHAPE=\"rect\" HREF=\"https://www.tensorflow.org/api_docs/python/tf/estimator/DNNClassifier\">TensorFlow DNNClassifier class</a>. If we were solving a regression problem, we would use the <a SHAPE=\"rect\" HREF=\"https://www.tensorflow.org/api_docs/python/tf/estimator/DNNRegressor\">TensorFlow DNNRegressor class</a>.There are <a SHAPE=\"rect\" HREF=\"https://www.tensorflow.org/api_docs/python/tf/estimator#Classes\">other classification and regression classes available from the TensorFlow Estimator API</a>. Some of these use linear mathematical models and some use linear models in combinations with DNNs. It is well worth investigating and understanding these, but none of them sound as cool as Deep Neural Network on your LinkedIn portfolio, so we will skip them for now.FeaturesGoogle Developers have an excellent <a SHAPE=\"rect\" HREF=\"https://developers.googleblog.com/2017/11/introducing-tensorflow-feature-columns.html\">blog post explaining TensorFlow Feature Columns</a> that goes into good detail about the options available.Our model will only use the numeric_column that is provided, but there are others available (such as a category_column).The DNNClassifier class we mentioned earlier requires an array of feature columns to be provided. Looking above to the test data section, we have quite a few features available to select.Removing the result field (that&rsquo;s going to be the label) and the odds fields, we are left with the following feature columns:feature_columns = [&nbsp; tf.feature_column.numeric_column(key=&apos;home-wins&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;home-draws&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;home-losses&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;home-goals&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;home-opposition-goals&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;home-shots&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;home-shots-on-target&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;home-opposition-shots&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;home-opposition-shots-on-target&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;away-wins&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;away-draws&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;away-losses&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;away-goals&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;away-opposition-goals&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;away-shots&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;away-shots-on-target&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;away-opposition-shots&apos;),&nbsp; tf.feature_column.numeric_column(key=&apos;away-opposition-shots-on-target&apos;),]Connecting it all Togethermodel = tf.estimator.DNNClassifier(&nbsp; model_dir=&apos;model/&apos;,&nbsp; hidden_units=[10],&nbsp; feature_columns=feature_columns,&nbsp; n_classes=3,&nbsp; label_vocabulary=[&apos;H&apos;, &apos;D&apos;, &apos;A&apos;],&nbsp; optimizer=tf.train.ProximalAdagradOptimizer(&nbsp;&nbsp;&nbsp; learning_rate=0.1,&nbsp;&nbsp;&nbsp; l1_regularization_strength=0.001&nbsp; ))This is where we create our model object. The model_dir parameter is used to save training progress so that you don&rsquo;t have to retrain your model every time you want to make a prediction. The hidden_units parameter describes the shape of the neural network, [10] corresponds to one hidden layer with 10 neurons in it. We define the output that we expect from our model with n_classes and label_vocabulary. Here we state that the three classes our model will analyse are labelled by H, D or A.The optimizer parameter is optional and the default value is reasonable for many cases. Here the default value is not used because it was necessary to add <a SHAPE=\"rect\" HREF=\"https://en.wikipedia.org/wiki/Regularization_(mathematics)\">regularization to prevent overfitting</a>.We can train our model using the train() method. A model can be trained indefinitely, but with diminishing returns. Different models descend at different rates, so it is important to watch the loss function to see if and when it has converged (and stopped descending).model.train(input_fn=train_input_fn, steps=1000)The input_fn parameter is used to provide training data to the model. There are lots of clever ways to feed data into a model, but using numpy arrays is pretty quick and easy:train_input_fn = tf.estimator.inputs.numpy_input_fn(&nbsp; x=train_features,&nbsp; y=train_labels,&nbsp; batch_size=500,&nbsp; num_epochs=None,&nbsp; shuffle=True&nbsp; )In the example above, if we had only 3 training examples, train_features and train_labels would have the structure shown below. The keys of train_features must match the keys used when creating the feature columns array.train_features = {&nbsp; &apos;home-goals&apos;: np.array([7, 3, 4]),&nbsp; &apos;home-opposition-goals&apos;: np.array([3, 8, 6]),&nbsp; # ... for each feature}train_labels = np.array([&apos;H&apos;, &apos;D&apos;, &apos;A&apos;])The code in <a SHAPE=\"rect\" HREF=\"https://github.com/AndrewCarterUK/football-predictor/blob/master/predict.py\">predict.py</a> takes the first 95% of results into train_results and the latest 5% into test_results. These are used to evaluate the accuracy of the model and the performance of the betting strategy.Developing a Betting StrategyIt is important to know that bookmakers do not optimise odds solely to reflect event probabilities. Fortunately for us, they have to consider markets and their exposure to risk too.Casual gamblers and football fans are generally motivated by opinions, excitement and loyalty. Thus, most are uninterested in betting that the outcome of a match will be a draw. Bookmakers tend to reduce the odds of popular bets to minimise their exposure to risk, and this makes it easier to be profitable when betting on draws rather than wins.The <a SHAPE=\"rect\" HREF=\"https://github.com/AndrewCarterUK/football-predictor/blob/master/betting.py\">betting.py</a> script shows an example betting strategy that utilises this logic. If our model believes that the bookmaker has underestimated the chance of a draw by 5% or more, it places a bet.The Results<img SRC=\"https://res.cloudinary.com/andrewcarteruk/image/upload/v1519094225/model_af3byz.png\" ALT=\"training graph\" WIDTH=\"110\" HEIGHT=\"28\"/>The above graph shows how the model developed as it was trained. The DNN converges quickly on a solution and achieves an accuracy of 51%. This accuracy is slightly below the performance of Bookmakers, Bet365 achieves around 53-54% on the same results.The betting return is less stable, and is in the region of a 50% return on investment. This strategy simulation placed 35 bets whilst considering 172 possible matches. It is difficult to generate an accurate betting return figure, as the strategy places a statistically small number of bets and there is not much test data.The odds used were only from Bet365, and further gains could probably be achieved by shopping around. That said, Bet365 often provided the most competitive odds available in the dataset.If you would like to learn more about machine learning, I can highly recommend <a SHAPE=\"rect\" HREF=\"https://www.coursera.org/learn/machine-learning\">Stanford University - Machine Learning by Andrew Ng</a>. I am about halfway through the course at the time of writing, and thoroughly appreciating its bottom up approach to these subjects.You may also be interested in my previous <a SHAPE=\"rect\" HREF=\"https://andrew.carterlunn.co.uk/programming/2018/01/24/annotating-large-datasets-with-tensorflow-object-detection-api.html\">article on object detection and recognition in images with TensorFlow</a>.&nbsp;&nbsp;&nbsp; AddThis Sharing ButtonsShare to TwitterShare to LinkedInShare to FacebookShare to 電子郵件&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <div TITLE=\"Twitter Follow Button\"></div>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; <div TITLE=\"Disqus\"></div><div TITLE=\"Disqus\"></div><div TITLE=\"Disqus\"></div>&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; </en-note>      ",
      "content_path": null,
      "diff_base_variant_id": null,
      "metadata": {
        "checksum": "d5fa1897f8b8b78824e790af83459b36ddc8033f380c20e33cb6211b924b7472",
        "path": "backups/2023年6月/IT技术/A Beginners Guide to Beating the Bookmakers with T.html"
      }
    },
    {
      "id": "5b30e445-3168-4b53-880b-574a8dd2e076",
      "note_id": "180406ed-abd2-4a2d-8d6b-56a30bc9d868",
      "variant_type": "clean_text",
      "version": 1,
      "created_by": "evernote_ingest:v0",
      "created_at": "2025-11-10T15:43:30.638459Z",
      "content": "---\ntitle: A Beginners Guide to Beating the Bookmakers with TensorFlow\nupdated: 2018-02-21 14:20:03Z\ncreated: 2018-02-21 14:19:30Z\nsource: >-\n  http://andrew.carterlunn.co.uk/programming/2018/02/20/beating-the-bookmakers-with-tensorflow.html\ntags:\n  - ai\n  - tensorflow\n  - 深度学习\n---\n\n                A Beginners Guide to Beating the Bookmakers with TensorFlow   \n            AddThis Sharing ButtonsShare to TwitterShare to LinkedInShare to FacebookShare to 電子郵件        Feb 20, 2018       Alan - It says here we should use TensorFlow. Apparently we can use a Deep Neural Network to predict the outcome of football (soccer) matches. Who wants to help me collect training data?  Doug - I don't think you should be doing so much gambling tonight Alan.  Alan - Gambling? Who said anything about gambling? It's not gambling if you know you're going to win? Deep Neural Networks are a foolproof system.  Stu - It's also illegal.  Alan - It's not illegal, it's frowned upon. Like mining bitcoin on web browsers.\nMy pitch for a remake of The Hangover didn’t go down very well, but hopefully the research I did for the script will still be useful to someone.This article explains how to use the\nTensorFlow Estimator API\n to create a simple Deep Neural Network (DNN) that makes predictions about football (soccer) matches. It will assume that you have\ninstalled TensorFlow\n and are familiar with the Python language.There is a corresponding\nGitHub repository\n containing the complete code that will be referenced throughout.What is a Deep Neural Network (DNN)?The critical thing for a beginner to understand about a DNN model, is that it is a function. Its purpose is to map a series of input features to an output. When we train our model, we provide a large number of examples where we know all of the features and the desired output, known as the labels. By analysing how bad our model is at predicting the labels, we can use some crazy calculus to modify its neurons and make it less bad at making predictions. This type of machine learning problem, where our training data is labelled, is a supervised learning problem.Our Test DataA quick google search for “football data” returns a link to\nfootball-data.co.uk\n - who would have thought?Looking only at the English Premier League results, I squished about 9 and a half seasons of data into a\nsingle CSV file\n. The file contains loads of useful fields, including goals, shots, shots on target, bookmaker odds and more. Football Data also provide a\ncolumn key for the data\n.The\ndataset.py\n script shows how this file is loaded.The Dataset class converts the CSV data to an array of processed football results containing the following keys. Not all of the results in the dataset can be used, as there needs to have been 10 games of history for each team before the statistics can be calculated.[{  'result': 'H', # Could be H, D or A (for home team win, draw or away team win)  'odds-home': 1.6, # Decimal odds from Bet365 on a home team win  'odds-draw': 4.8, # Decimal odds from Bet365 on a draw  'odds-away': 6.0, # Decimal odds from Bet365 on an away team win  'home-wins': 6, # Number of wins by the home team in the last 10 games  'home-draws': 2, # Number of draws by the home team in the last 10 games  'home-losses': 2, # Number of losses by the home team in the last 10 games  'home-goals': 16, # Number of goals scored by the home team in the last 10 games  'home-opposition-goals': 12, # Number of goals scored against the home team in the last 10 games  'home-shots': 68, # Number of shots made by the home team in the last 10 games  'home-shots-on-target': 53, # Number of shots on target made by the home team in the last 10 games  'home-opposition-shots': 20, # Number of shots made against the home team in the last 10 games  'home-opposition-shots-on-target': 14, # Number of shots on target made against the home team in the last 10 games  'away-wins': 3, # Number of wins by the away team in the last 10 games  'away-draws': 4, # Number of draws by the away team in the last 10 games  'away-losses': 3, # Number of losses by the away team in the last 10 games  'away-goals': 13, # Number of goals scored by the away team in the last 10 games  'away-opposition-goals': 17, # Number of goals scored against the away team in the last 10 games  'away-shots': 32, # Number of shots made by the away team in the last 10 games  'away-shots-on-target': 13, # Number of shots on target made by the away team in the last 10 games  'away-opposition-shots': 47, # Number of shots made against the away team in the last 10 games  'away-opposition-shots-on-target': 21, # Number of shots on target made against the away team in the last 10 games]}Classification or RegressionThe next step is to look at the options available for the type of predictions our model will make. In this regard, there are two primary model types, and these are known as classification or regression models.A classification model will output a prediction that the input features match a set of classes. An example of this would be using biometric measurements to predict whether a subject was of class male or female. Here, the output from our model would be a two dimensional vector containing the probability that the subject was male and the probability that the subject was female. All classification probabilities in a prediction sum to one.A regression model outputs a continuous variable (or a vector of continuous variables). An example of this would be using house features (such as location, size and bedrooms) to predict house price.We are going to use a classification model. Our three available classes will be home win H, draw D and away win A. If the output from our model for a given set of features was [0.23, 0.65, 0.12], that would correspond to a prediction that there was a 23% chance of the home team winning, a 65% chance of a draw and a 12% chance of the away team winning.This model choice means that we will be using the\nTensorFlow DNNClassifier class\n. If we were solving a regression problem, we would use the\nTensorFlow DNNRegressor class\n.There are\nother classification and regression classes available from the TensorFlow Estimator API\n. Some of these use linear mathematical models and some use linear models in combinations with DNNs. It is well worth investigating and understanding these, but none of them sound as cool as Deep Neural Network on your LinkedIn portfolio, so we will skip them for now.FeaturesGoogle Developers have an excellent\nblog post explaining TensorFlow Feature Columns\n that goes into good detail about the options available.Our model will only use the numeric_column that is provided, but there are others available (such as a category_column).The DNNClassifier class we mentioned earlier requires an array of feature columns to be provided. Looking above to the test data section, we have quite a few features available to select.Removing the result field (that’s going to be the label) and the odds fields, we are left with the following feature columns:feature_columns = [  tf.feature_column.numeric_column(key='home-wins'),  tf.feature_column.numeric_column(key='home-draws'),  tf.feature_column.numeric_column(key='home-losses'),  tf.feature_column.numeric_column(key='home-goals'),  tf.feature_column.numeric_column(key='home-opposition-goals'),  tf.feature_column.numeric_column(key='home-shots'),  tf.feature_column.numeric_column(key='home-shots-on-target'),  tf.feature_column.numeric_column(key='home-opposition-shots'),  tf.feature_column.numeric_column(key='home-opposition-shots-on-target'),  tf.feature_column.numeric_column(key='away-wins'),  tf.feature_column.numeric_column(key='away-draws'),  tf.feature_column.numeric_column(key='away-losses'),  tf.feature_column.numeric_column(key='away-goals'),  tf.feature_column.numeric_column(key='away-opposition-goals'),  tf.feature_column.numeric_column(key='away-shots'),  tf.feature_column.numeric_column(key='away-shots-on-target'),  tf.feature_column.numeric_column(key='away-opposition-shots'),  tf.feature_column.numeric_column(key='away-opposition-shots-on-target'),]Connecting it all Togethermodel = tf.estimator.DNNClassifier(  model_dir='model/',  hidden_units=[10],  feature_columns=feature_columns,  n_classes=3,  label_vocabulary=['H', 'D', 'A'],  optimizer=tf.train.ProximalAdagradOptimizer(    learning_rate=0.1,    l1_regularization_strength=0.001  ))This is where we create our model object. The model_dir parameter is used to save training progress so that you don’t have to retrain your model every time you want to make a prediction. The hidden_units parameter describes the shape of the neural network, [10] corresponds to one hidden layer with 10 neurons in it. We define the output that we expect from our model with n_classes and label_vocabulary. Here we state that the three classes our model will analyse are labelled by H, D or A.The optimizer parameter is optional and the default value is reasonable for many cases. Here the default value is not used because it was necessary to add\nregularization to prevent overfitting\n.We can train our model using the train() method. A model can be trained indefinitely, but with diminishing returns. Different models descend at different rates, so it is important to watch the loss function to see if and when it has converged (and stopped descending).model.train(input_fn=train_input_fn, steps=1000)The input_fn parameter is used to provide training data to the model. There are lots of clever ways to feed data into a model, but using numpy arrays is pretty quick and easy:train_input_fn = tf.estimator.inputs.numpy_input_fn(  x=train_features,  y=train_labels,  batch_size=500,  num_epochs=None,  shuffle=True  )In the example above, if we had only 3 training examples, train_features and train_labels would have the structure shown below. The keys of train_features must match the keys used when creating the feature columns array.train_features = {  'home-goals': np.array([7, 3, 4]),  'home-opposition-goals': np.array([3, 8, 6]),  # ... for each feature}train_labels = np.array(['H', 'D', 'A'])The code in\npredict.py\n takes the first 95% of results into train_results and the latest 5% into test_results. These are used to evaluate the accuracy of the model and the performance of the betting strategy.Developing a Betting StrategyIt is important to know that bookmakers do not optimise odds solely to reflect event probabilities. Fortunately for us, they have to consider markets and their exposure to risk too.Casual gamblers and football fans are generally motivated by opinions, excitement and loyalty. Thus, most are uninterested in betting that the outcome of a match will be a draw. Bookmakers tend to reduce the odds of popular bets to minimise their exposure to risk, and this makes it easier to be profitable when betting on draws rather than wins.The\nbetting.py\n script shows an example betting strategy that utilises this logic. If our model believes that the bookmaker has underestimated the chance of a draw by 5% or more, it places a bet.The Results\nThe above graph shows how the model developed as it was trained. The DNN converges quickly on a solution and achieves an accuracy of 51%. This accuracy is slightly below the performance of Bookmakers, Bet365 achieves around 53-54% on the same results.The betting return is less stable, and is in the region of a 50% return on investment. This strategy simulation placed 35 bets whilst considering 172 possible matches. It is difficult to generate an accurate betting return figure, as the strategy places a statistically small number of bets and there is not much test data.The odds used were only from Bet365, and further gains could probably be achieved by shopping around. That said, Bet365 often provided the most competitive odds available in the dataset.If you would like to learn more about machine learning, I can highly recommend\nStanford University - Machine Learning by Andrew Ng\n. I am about halfway through the course at the time of writing, and thoroughly appreciating its bottom up approach to these subjects.You may also be interested in my previous\narticle on object detection and recognition in images with TensorFlow\n.    AddThis Sharing ButtonsShare to TwitterShare to LinkedInShare to FacebookShare to 電子郵件",
      "content_path": null,
      "diff_base_variant_id": null,
      "metadata": {
        "language": "en",
        "length": 12313,
        "rule_count": 2,
        "applied_rules": [
          {
            "rule_id": "dedupe_lines",
            "description": "Collapse adjacent duplicate lines",
            "note": "collapsed duplicate adjacent lines"
          },
          {
            "rule_id": "whitespace",
            "description": "Normalize whitespace",
            "note": "collapsed whitespace"
          }
        ]
      }
    }
  ],
  "extractions": [],
  "journal": {
    "id": "fd9c8e53-803c-4ffc-b89d-06f07b8969a2",
    "note_id": "180406ed-abd2-4a2d-8d6b-56a30bc9d868",
    "stage": "ingest",
    "agent_id": "evernote_ingest:v0",
    "started_at": "2025-11-10T15:43:30.638464Z",
    "finished_at": "2025-11-10T15:43:30.638465Z",
    "status": "success",
    "input_ref": {
      "task_id": "a16c5421-404a-40a4-b193-a7d56c792dbd",
      "source_path": "backups/2023年6月/IT技术/A Beginners Guide to Beating the Bookmakers with T.html",
      "checksum": "d5fa1897f8b8b78824e790af83459b36ddc8033f380c20e33cb6211b924b7472"
    },
    "output_ref": {
      "ingest_source": "579b8970-2e74-4369-bd0a-8d5270088036",
      "note": "180406ed-abd2-4a2d-8d6b-56a30bc9d868",
      "variants": [
        "afb48fb3-95ab-4789-8963-60e44465e706",
        "5b30e445-3168-4b53-880b-574a8dd2e076"
      ]
    },
    "error_detail": null
  }
}