{
  "ingest_source": {
    "id": "b2783d13-4726-4aa2-87a2-af5a94568c31",
    "source_type": "evernote_html",
    "source_path": "backups/2023年6月/个人的乱78糟/莫諾托夫雞尾酒.html",
    "collected_at": "2025-11-10T15:43:34.473416Z",
    "external_id": null,
    "title_hint": null,
    "language_hint": "ko",
    "captured_at": null,
    "checksum": "cf1abe92d735082da81e6f592569c4b0e931286522389983971bfab6f17a0f40",
    "status": "pending",
    "notes": {
      "batch_id": "phase2-backfill-202306"
    }
  },
  "note": {
    "id": "fe078b67-a1fc-4629-88b0-0e2ee56eff06",
    "ingest_source_id": "b2783d13-4726-4aa2-87a2-af5a94568c31",
    "canonical_title": "莫諾托夫雞尾酒",
    "language": "ko",
    "ingested_at": "2025-11-10T15:43:34.473420Z",
    "created_at": null,
    "status": "active",
    "importance": 0,
    "attributes": {
      "source_filename": "莫諾托夫雞尾酒.html"
    }
  },
  "variants": [
    {
      "id": "4e14d4fb-447b-4f1f-a270-74b845c1f551",
      "note_id": "fe078b67-a1fc-4629-88b0-0e2ee56eff06",
      "variant_type": "raw_html",
      "version": 1,
      "created_by": "evernote_ingest:v0",
      "created_at": "2025-11-10T15:43:34.473423Z",
      "content": "---\ntitle: 莫諾托夫雞尾酒\nupdated: 2013-08-27 04:50:12Z\ncreated: 2013-07-05 15:11:33Z\n---\n\n\n\n\n<en-note STYLE=\"word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space;\"><div>&nbsp; &nbsp; &nbsp; &nbsp;莫諾托夫雞尾酒是土制燃烧弹的別稱。來自蘇聯的外交人民委員（外交部 長）维亚切斯拉夫&centerdot;米哈伊洛维奇&centerdot;莫洛托夫。二次大戰時蘇聯入侵芬兰，芬蘭士兵無論是人數或裝備皆處於下風。面對紅軍的坦克，芬蘭人借用了之前在西班牙内战時，這種由蘇聯人支持的共和派人發明的燃燒瓶武器。&nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; 在蘇芬戰爭中，苏联轟炸機曾用燃燒彈轟炸芬蘭的城市和平民目標。面對國際社會的指責時，莫洛托夫宣稱蘇聯飛機沒有向芬蘭人民扔下炸彈，而是向他們空投面包。</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; 芬蘭軍民便將蘇聯燃燒彈稱為&ldquo;莫洛托夫面包籃&rdquo;，并將他們准備的這種燃燒瓶稱為莫諾托夫雞尾酒，用來招待蘇聯坦克。芬蘭軍方在之后持續的戰事中大量生產燃燒瓶，以手或擲石器投擲。</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp;后來蘇聯人在卫国战争時面對着如潮水般的德國坦克時， 又想到了這種可怕的武器。由於德國坦克的尾部往往是防御最少的，但恰恰是坦克發動機和油箱的所在之處。當莫諾托夫雞尾酒在坦克的尾部燃燒時，可能令坦克的 發動機過熱而拋錨和油缸爆炸。當蘇聯士兵在近距離以燃燒彈快速突擊，坦克的靈活性不足應付，於是陷入被動。這亦是莫諾托夫雞尾酒在當時能&ldquo;一戰成名&rdquo;的原 因之一。二戰東線戰役中莫諾托夫雞尾酒的使用達到頂峰，它最便宜有效的反坦克武器﹐對坦克的效能超過集束手榴彈，只要將它投入坦克脆弱的發動機排氣口里， 這些不可一世的德國鋼鐵巨獸就馬上起火趴窩了。&nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;德国用坦克進攻西班牙時，西班牙人拿不出更好的对策，在绝望中他们只好跟坦克打交手战。人&nbsp;</div><div>們躺在壕溝或塹壕內，等坦克快要開到他們身體上方時，他們突然跳了起來，爬到坦克頂部，對着觀察孔向車內射擊，或者用撬杠撬開乘員艙口蓋板或火炮發射孔板，然后向里射擊。有的戰士向發動機內傾注汽油，把它點燃。&nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; 在這種交手戰中，西班牙人發明了一種極其簡易的反坦克武器，叫莫洛托夫雞尾酒瓶炸彈。几乎人人能做，家家可以制造，這種武器多少給德國的坦克帶來了威脅。&nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;一旦見到敵人坦克來了，就使勁搖動酒瓶，然后向坦克投擊。一旦瓶子撞碎在坦克上之后，流出的黃燐在空氣中立即燃燒，火焰很猛烈。這種武器本身不能把坦克擊毀，但往往給坦克造成極大的破壞。&nbsp;</div><div><br/></div><div>燃燒的濃煙很快會進入坦克乘員艙內，滾滾濃煙首先引起駕駛人員的驚慌，怕發生爆炸，總是趕快停止操作，從艙口向外爬 出來。這個時候就很容易被反坦克手用槍打死，當時坦克都釆用汽油，而且油箱都在外部，莫洛托夫雞尾酒瓶的炸彈一燃燒，往往把坦克油箱點燃，然后引起坦克燃 燒，失去油料而停止運動。&nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; 當然莫洛托夫雞尾酒瓶炸彈在運用上是危險的，跟坦克距離很近，具有冒險性。但在沒有辦法時想出這招，這不能不說是西班牙人的一種創造。</div><div><br/></div><div>典型配方：</div><div><br/></div><div>1.三分之二的汽油與三分之一的糖混合。&nbsp;</div><div>2.三分之一的洗衣粉和三分之二的汽油，再加上少量其他油料。&nbsp;</div><div>3.氯酸鉀（某些潤喉片含有它）和糖按3：1混合具有驚人的燃燒力。&nbsp;</div><div>4.高錳酸鉀和糖按9：1混合也可以，但不如上一個配方易燃。&nbsp;</div><div>5.氯酸鉀（除草劑的主要成分）和糖按3：1混合使用。 &nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; 瓶頸纏有浸油粗麻縴維布帶，供在投擲前點燃用。如果不想點燃，那么在汽油和糖的混合液中加入硝酸鉀，這樣不需引燃，強烈的撞擊就可以自然發火甚至爆炸。 &nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp;找個啤酒瓶子裝上汽油，塞個布頭，用火機一點，轟！整個世界就平靜了！（俗稱莫羅托夫雞尾酒）。不客氣地說一句，如果用文明史來打比方的話，這也就處於周口店的水平。古人曰，學無止境，難道在這么個水平你就滿足了？那可真是缺乏進取心。另外， 燃燒彈是不會有轟的聲音的，最多就是玻璃瓶子碎掉的呯。</div><div><br/></div><div>&nbsp;　　要講講如何制作性能優良，質量上乘的燃燒彈，首先要弄清楚几個概念，怎樣才是 一個性能優良的燃燒彈。燃燒值高，燃燒溫度高固然是一個重要方面，還有更重要的包 括燃燒速度，和抗滅火能力，以及必要的附加性質和殺傷能力等等。</div><div><br/></div><div>&nbsp;　　無論從哪個角度說，單純使用汽油作的燃燒彈都是三流中的三流貨色。從前段時間某些自焚人士的實踐表明，在一個消防體系完備的環境中，純汽油根本無法起到高效的殺傷作用。 &nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; 汽油的燃燒值是無需懷疑的，但是燃燒值高并不意味著燃燒溫度就高。大家可能知 道，大部分所謂易燃物質如酒精等都不能在液態下直接燃燒，我們所點燃的都是揮發到 空氣中的蒸汽，他們必須以氣態才能夠與氧氣充分混合燃燒。燃燒的火焰提高溫度加速 液體揮發，燃燒才能進行。這一方面浪費了大量的氣化熱，一方面也限制了燃燒溫度。 其實很多江湖賣藝的都會做一種表演：將手泡到酒精中后取出點燃，可以看到手上的淡 藍色火焰，看似驚險其實沒有什么奧秘，更不會對人體造成傷害，他們甚至能夠感覺手 上涼颼颼的，只要有膽量，大部分人都可以作。提高溫度通常會在汽油中添加一些燃 劑，就我個人而言可能是添加鎂粉或者鋁熱劑，普通火焰溫度是几百度，以這種添加劑 可以達到一千度，一千五百度，高的可能接近兩千度。不但加大殺傷力和引燃能力，也 可以大大加快燃劑揮發速度。 &nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; 除了提高溫度，抗滅火能力也是極其重要的，很多人有一種根深蒂固的觀念，火焰 總是會被滅火器撲滅的，事實上，燃燒彈甚至能反客為主令滅火措施完全失效。</div><div><br/></div><div>最簡單反滅火手段莫過於大大加快燃燒速度， 在對方還沒有來得及作出反應的時候就結束，或者把火勢放大到不可收拾的地步。上面 的鎂粉就是一種，高溫下汽油揮發燃燒速度起碼加快兩倍。</div><div><br/></div><div>其次就是抗滅火器了，目前 比較廣泛應用的是水，二氧化碳的泡沫滅火器，干粉滅火器等等。這些滅火器的工作原 理是降溫，隔絕空氣中的氧氣，和干擾火焰中的活性基團結合等等。這些都是可以避開 的，首先是水，不能用水來滅油類火災是常識，所以我們通常不會碰到，即使碰到了， 不但加速火勢蔓延，還可能因為鎂在熱水中生成氫氧化鎂放出氫氣，在爆炸極限濃度中 甚至可以產生爆炸，我們求之不得。嘿嘿，接下來是二氧化碳滅火劑，那就更有意思 了，不廣為人所知的一件事情是，鎂不僅能夠在空氣中燃燒，它還可以在二氧化碳中燃 燒！放出大量的熱然后變為氧化鎂和碳，至於碳作用也不小，它是呈微粒的粉狀，在有 水情況下可能會產生水煤氣，也就是一氧化碳和氫氣的混合物，無水情況下也可以不完 全燃燒成一氧化碳，或者回到老家去變成二氧化碳。總之即使燃燒，也可能產生有毒氣 體。</div><div><br/></div><div>最后是對付干粉滅火器，干粉滅火器的原理是產生大量小微粒以干粉形式噴到火焰 上，干擾活性基團的結合，從而滅火。這就回到了燃燒的本質問題上來了，燃燒作為一 種比較劇烈的氧化還原反應，空氣中的氧氣是比較常見的氧化劑，但絕對不是唯一的， 必要時甚至可以自備氧化劑。通常的硝酸、硝酸鉀和濃硫酸都是相當不錯的，這樣一來 就徹底消除了以隔絕空氣的滅火手段。 &nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; 最后就是黏著能力的問題，很多時候我們的目標是傾斜或者垂直的平面，如果用汽 油很可能會流光而無法達到效果，通常可以使用橡膠溶劑來調節粘稠度。做法是把橡膠 （盡量選擇天然的）切成小塊，溶解到汽油中即可。 &nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp; 好了，現在出現了兩種思路。第一種就是高溫快速派的，方法是橡膠溶解汽油中添 加堿液、鎂粉、鋁熱劑、油脂、松香、蛋清、肥皂、石蠟和甚至動物血。這些材料的不 是必要的，屬於可選范圍，比例和配方自定，它的特點是溫度高，粘著性很犟，燃燒迅 速。還有熾熱的鐵水和鎂氧化輔助。基本上無法撲滅也來不及撲滅。性質與軍方使用的 膠凝汽油差不多。引燃系統我推荐是把一兩塊干淨的鈉用薄的藥棉裹好貼在瓶子表面， 這樣一來，一旦瓶子被扔出破裂，鈉和瓶內的一些水份及有機物接觸，就會發生反應放 熱和氫氣，點燃燃燒彈。千萬不要和我談什么拿打火機點布條之類的手段，傳出去都不 好意思見人。 &nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp;另一種思路則是，同樣是橡膠汽油，但是添加的是濃硫酸、硝酸鉀、木工的鋸末和 少量研碎石蠟，這里要注意的是，濃硫酸占的體積分數可以到10%左右。它的特點是自 帶氧化劑，所以可以抗許多滅火器材，甚至還有一定的爆炸能力。撲滅的可能性比前者 還要低。基本碰上就是神仙也無救。引燃系統就比較多種多樣了，前者的棉花裹鈉仍然 可以使用，其次就是在表面貼上一層在氯化鉀、糖，混合溶液中浸泡過晾干的紙。瓶子 一破，硫酸與這些成分接觸就會燃燒起來。好像還有一種就是在溶液中添加高錳酸鉀， 缺點是不穩定，容易走火。還有一點就是要盡量保證燃燒液中沒有水分，因為有水分的 話，濃硫酸會產生氫離子，使硝酸鉀變為酸性，比較危險。 &nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp;當然咯，以一個完美主義者的態度來看，兩個燃燒彈合在一起是最好的，但是不能 夠直接混合，因為一個酸性一個堿性，如果可以的話，二個瓶子裝捆在一起無疑是非常 好的，基本就是無所畏懼的超級燃燒彈了。哈哈哈。 &nbsp;</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp;除這些以外，您也可以添加一些其他的東西，比如建筑上使用的松節油，油漆，其 他的如塑料袋等，可以產生濃重的黑煙和刺激性氣體和少量毒性，干擾滅火人。</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp;由於燃燒瓶制作容易，使它几乎已成為游擊隊及街頭暴民的&ldquo;標准裝備&rdquo;。但對全無經驗的人來說，制造及使用燃燒瓶亦非全無難度。第一種常犯的錯誤是瓶內放進太多的汽油，在玻璃瓶碎開后過多汽油會難以着火。另一種錯誤是點燃布塊前沒有把玻璃瓶抹干淨，使瓶外殘余的汽油燃燒起來。此外，用作引信的布塊來封住玻璃瓶也是錯誤的作法。其他各種錯誤包括瓶子的塞不密封，選用錯誤（太堅固或太易碎，瓶頸太長或太寬）的玻璃瓶等等。但最常見的錯誤還是點燃以后的投擲過程出錯。</div><div><br/></div><div>&nbsp; &nbsp; &nbsp; &nbsp;燃燒瓶雖說是制作簡單，但對不熟悉的人來說它還是存在一定的危險。</div></en-note>      ",
      "content_path": null,
      "diff_base_variant_id": null,
      "metadata": {
        "checksum": "cf1abe92d735082da81e6f592569c4b0e931286522389983971bfab6f17a0f40",
        "path": "backups/2023年6月/个人的乱78糟/莫諾托夫雞尾酒.html"
      }
    },
    {
      "id": "b2c688a5-d2eb-45f0-8152-511e7ce7a7d3",
      "note_id": "fe078b67-a1fc-4629-88b0-0e2ee56eff06",
      "variant_type": "clean_text",
      "version": 1,
      "created_by": "evernote_ingest:v0",
      "created_at": "2025-11-10T15:43:34.473426Z",
      "content": "---\ntitle: 莫諾托夫雞尾酒\nupdated: 2013-08-27 04:50:12Z\ncreated: 2013-07-05 15:11:33Z\n---\n\n       莫諾托夫雞尾酒是土制燃烧弹的別稱。來自蘇聯的外交人民委員（外交部 長）维亚切斯拉夫·米哈伊洛维奇·莫洛托夫。二次大戰時蘇聯入侵芬兰，芬蘭士兵無論是人數或裝備皆處於下風。面對紅軍的坦克，芬蘭人借用了之前在西班牙内战時，這種由蘇聯人支持的共和派人發明的燃燒瓶武器。 \n        在蘇芬戰爭中，苏联轟炸機曾用燃燒彈轟炸芬蘭的城市和平民目標。面對國際社會的指責時，莫洛托夫宣稱蘇聯飛機沒有向芬蘭人民扔下炸彈，而是向他們空投面包。\n        芬蘭軍民便將蘇聯燃燒彈稱為“莫洛托夫面包籃”，并將他們准備的這種燃燒瓶稱為莫諾托夫雞尾酒，用來招待蘇聯坦克。芬蘭軍方在之后持續的戰事中大量生產燃燒瓶，以手或擲石器投擲。\n       后來蘇聯人在卫国战争時面對着如潮水般的德國坦克時， 又想到了這種可怕的武器。由於德國坦克的尾部往往是防御最少的，但恰恰是坦克發動機和油箱的所在之處。當莫諾托夫雞尾酒在坦克的尾部燃燒時，可能令坦克的 發動機過熱而拋錨和油缸爆炸。當蘇聯士兵在近距離以燃燒彈快速突擊，坦克的靈活性不足應付，於是陷入被動。這亦是莫諾托夫雞尾酒在當時能“一戰成名”的原 因之一。二戰東線戰役中莫諾托夫雞尾酒的使用達到頂峰，它最便宜有效的反坦克武器﹐對坦克的效能超過集束手榴彈，只要將它投入坦克脆弱的發動機排氣口里， 這些不可一世的德國鋼鐵巨獸就馬上起火趴窩了。 \n         德国用坦克進攻西班牙時，西班牙人拿不出更好的对策，在绝望中他们只好跟坦克打交手战。人 \n們躺在壕溝或塹壕內，等坦克快要開到他們身體上方時，他們突然跳了起來，爬到坦克頂部，對着觀察孔向車內射擊，或者用撬杠撬開乘員艙口蓋板或火炮發射孔板，然后向里射擊。有的戰士向發動機內傾注汽油，把它點燃。 \n        在這種交手戰中，西班牙人發明了一種極其簡易的反坦克武器，叫莫洛托夫雞尾酒瓶炸彈。几乎人人能做，家家可以制造，這種武器多少給德國的坦克帶來了威脅。 \n         一旦見到敵人坦克來了，就使勁搖動酒瓶，然后向坦克投擊。一旦瓶子撞碎在坦克上之后，流出的黃燐在空氣中立即燃燒，火焰很猛烈。這種武器本身不能把坦克擊毀，但往往給坦克造成極大的破壞。 \n燃燒的濃煙很快會進入坦克乘員艙內，滾滾濃煙首先引起駕駛人員的驚慌，怕發生爆炸，總是趕快停止操作，從艙口向外爬 出來。這個時候就很容易被反坦克手用槍打死，當時坦克都釆用汽油，而且油箱都在外部，莫洛托夫雞尾酒瓶的炸彈一燃燒，往往把坦克油箱點燃，然后引起坦克燃 燒，失去油料而停止運動。 \n        當然莫洛托夫雞尾酒瓶炸彈在運用上是危險的，跟坦克距離很近，具有冒險性。但在沒有辦法時想出這招，這不能不說是西班牙人的一種創造。\n典型配方：\n1.三分之二的汽油與三分之一的糖混合。 \n2.三分之一的洗衣粉和三分之二的汽油，再加上少量其他油料。 \n3.氯酸鉀（某些潤喉片含有它）和糖按3：1混合具有驚人的燃燒力。 \n4.高錳酸鉀和糖按9：1混合也可以，但不如上一個配方易燃。 \n5.氯酸鉀（除草劑的主要成分）和糖按3：1混合使用。  \n      瓶頸纏有浸油粗麻縴維布帶，供在投擲前點燃用。如果不想點燃，那么在汽油和糖的混合液中加入硝酸鉀，這樣不需引燃，強烈的撞擊就可以自然發火甚至爆炸。  \n       找個啤酒瓶子裝上汽油，塞個布頭，用火機一點，轟！整個世界就平靜了！（俗稱莫羅托夫雞尾酒）。不客氣地說一句，如果用文明史來打比方的話，這也就處於周口店的水平。古人曰，學無止境，難道在這么個水平你就滿足了？那可真是缺乏進取心。另外， 燃燒彈是不會有轟的聲音的，最多就是玻璃瓶子碎掉的呯。\n 　　要講講如何制作性能優良，質量上乘的燃燒彈，首先要弄清楚几個概念，怎樣才是 一個性能優良的燃燒彈。燃燒值高，燃燒溫度高固然是一個重要方面，還有更重要的包 括燃燒速度，和抗滅火能力，以及必要的附加性質和殺傷能力等等。\n 　　無論從哪個角度說，單純使用汽油作的燃燒彈都是三流中的三流貨色。從前段時間某些自焚人士的實踐表明，在一個消防體系完備的環境中，純汽油根本無法起到高效的殺傷作用。  \n        汽油的燃燒值是無需懷疑的，但是燃燒值高并不意味著燃燒溫度就高。大家可能知 道，大部分所謂易燃物質如酒精等都不能在液態下直接燃燒，我們所點燃的都是揮發到 空氣中的蒸汽，他們必須以氣態才能夠與氧氣充分混合燃燒。燃燒的火焰提高溫度加速 液體揮發，燃燒才能進行。這一方面浪費了大量的氣化熱，一方面也限制了燃燒溫度。 其實很多江湖賣藝的都會做一種表演：將手泡到酒精中后取出點燃，可以看到手上的淡 藍色火焰，看似驚險其實沒有什么奧秘，更不會對人體造成傷害，他們甚至能夠感覺手 上涼颼颼的，只要有膽量，大部分人都可以作。提高溫度通常會在汽油中添加一些燃 劑，就我個人而言可能是添加鎂粉或者鋁熱劑，普通火焰溫度是几百度，以這種添加劑 可以達到一千度，一千五百度，高的可能接近兩千度。不但加大殺傷力和引燃能力，也 可以大大加快燃劑揮發速度。  \n        除了提高溫度，抗滅火能力也是極其重要的，很多人有一種根深蒂固的觀念，火焰 總是會被滅火器撲滅的，事實上，燃燒彈甚至能反客為主令滅火措施完全失效。\n最簡單反滅火手段莫過於大大加快燃燒速度， 在對方還沒有來得及作出反應的時候就結束，或者把火勢放大到不可收拾的地步。上面 的鎂粉就是一種，高溫下汽油揮發燃燒速度起碼加快兩倍。\n其次就是抗滅火器了，目前 比較廣泛應用的是水，二氧化碳的泡沫滅火器，干粉滅火器等等。這些滅火器的工作原 理是降溫，隔絕空氣中的氧氣，和干擾火焰中的活性基團結合等等。這些都是可以避開 的，首先是水，不能用水來滅油類火災是常識，所以我們通常不會碰到，即使碰到了， 不但加速火勢蔓延，還可能因為鎂在熱水中生成氫氧化鎂放出氫氣，在爆炸極限濃度中 甚至可以產生爆炸，我們求之不得。嘿嘿，接下來是二氧化碳滅火劑，那就更有意思 了，不廣為人所知的一件事情是，鎂不僅能夠在空氣中燃燒，它還可以在二氧化碳中燃 燒！放出大量的熱然后變為氧化鎂和碳，至於碳作用也不小，它是呈微粒的粉狀，在有 水情況下可能會產生水煤氣，也就是一氧化碳和氫氣的混合物，無水情況下也可以不完 全燃燒成一氧化碳，或者回到老家去變成二氧化碳。總之即使燃燒，也可能產生有毒氣 體。\n最后是對付干粉滅火器，干粉滅火器的原理是產生大量小微粒以干粉形式噴到火焰 上，干擾活性基團的結合，從而滅火。這就回到了燃燒的本質問題上來了，燃燒作為一 種比較劇烈的氧化還原反應，空氣中的氧氣是比較常見的氧化劑，但絕對不是唯一的， 必要時甚至可以自備氧化劑。通常的硝酸、硝酸鉀和濃硫酸都是相當不錯的，這樣一來 就徹底消除了以隔絕空氣的滅火手段。  \n        最后就是黏著能力的問題，很多時候我們的目標是傾斜或者垂直的平面，如果用汽 油很可能會流光而無法達到效果，通常可以使用橡膠溶劑來調節粘稠度。做法是把橡膠 （盡量選擇天然的）切成小塊，溶解到汽油中即可。  \n        好了，現在出現了兩種思路。第一種就是高溫快速派的，方法是橡膠溶解汽油中添 加堿液、鎂粉、鋁熱劑、油脂、松香、蛋清、肥皂、石蠟和甚至動物血。這些材料的不 是必要的，屬於可選范圍，比例和配方自定，它的特點是溫度高，粘著性很犟，燃燒迅 速。還有熾熱的鐵水和鎂氧化輔助。基本上無法撲滅也來不及撲滅。性質與軍方使用的 膠凝汽油差不多。引燃系統我推荐是把一兩塊干淨的鈉用薄的藥棉裹好貼在瓶子表面， 這樣一來，一旦瓶子被扔出破裂，鈉和瓶內的一些水份及有機物接觸，就會發生反應放 熱和氫氣，點燃燃燒彈。千萬不要和我談什么拿打火機點布條之類的手段，傳出去都不 好意思見人。  \n       另一種思路則是，同樣是橡膠汽油，但是添加的是濃硫酸、硝酸鉀、木工的鋸末和 少量研碎石蠟，這里要注意的是，濃硫酸占的體積分數可以到10%左右。它的特點是自 帶氧化劑，所以可以抗許多滅火器材，甚至還有一定的爆炸能力。撲滅的可能性比前者 還要低。基本碰上就是神仙也無救。引燃系統就比較多種多樣了，前者的棉花裹鈉仍然 可以使用，其次就是在表面貼上一層在氯化鉀、糖，混合溶液中浸泡過晾干的紙。瓶子 一破，硫酸與這些成分接觸就會燃燒起來。好像還有一種就是在溶液中添加高錳酸鉀， 缺點是不穩定，容易走火。還有一點就是要盡量保證燃燒液中沒有水分，因為有水分的 話，濃硫酸會產生氫離子，使硝酸鉀變為酸性，比較危險。  \n       當然咯，以一個完美主義者的態度來看，兩個燃燒彈合在一起是最好的，但是不能 夠直接混合，因為一個酸性一個堿性，如果可以的話，二個瓶子裝捆在一起無疑是非常 好的，基本就是無所畏懼的超級燃燒彈了。哈哈哈。  \n       除這些以外，您也可以添加一些其他的東西，比如建筑上使用的松節油，油漆，其 他的如塑料袋等，可以產生濃重的黑煙和刺激性氣體和少量毒性，干擾滅火人。\n       由於燃燒瓶制作容易，使它几乎已成為游擊隊及街頭暴民的“標准裝備”。但對全無經驗的人來說，制造及使用燃燒瓶亦非全無難度。第一種常犯的錯誤是瓶內放進太多的汽油，在玻璃瓶碎開后過多汽油會難以着火。另一種錯誤是點燃布塊前沒有把玻璃瓶抹干淨，使瓶外殘余的汽油燃燒起來。此外，用作引信的布塊來封住玻璃瓶也是錯誤的作法。其他各種錯誤包括瓶子的塞不密封，選用錯誤（太堅固或太易碎，瓶頸太長或太寬）的玻璃瓶等等。但最常見的錯誤還是點燃以后的投擲過程出錯。\n       燃燒瓶雖說是制作簡單，但對不熟悉的人來說它還是存在一定的危險。",
      "content_path": null,
      "diff_base_variant_id": null,
      "metadata": {
        "language": "ko",
        "length": 4038,
        "rule_count": 0,
        "applied_rules": []
      }
    }
  ],
  "extractions": [],
  "journal": {
    "id": "591f63db-7cd3-44bb-87de-10d1fd0d8209",
    "note_id": "fe078b67-a1fc-4629-88b0-0e2ee56eff06",
    "stage": "ingest",
    "agent_id": "evernote_ingest:v0",
    "started_at": "2025-11-10T15:43:34.473431Z",
    "finished_at": "2025-11-10T15:43:34.473431Z",
    "status": "success",
    "input_ref": {
      "task_id": "425ceae2-11c4-49a1-b250-9f785b3b8fff",
      "source_path": "backups/2023年6月/个人的乱78糟/莫諾托夫雞尾酒.html",
      "checksum": "cf1abe92d735082da81e6f592569c4b0e931286522389983971bfab6f17a0f40"
    },
    "output_ref": {
      "ingest_source": "b2783d13-4726-4aa2-87a2-af5a94568c31",
      "note": "fe078b67-a1fc-4629-88b0-0e2ee56eff06",
      "variants": [
        "4e14d4fb-447b-4f1f-a270-74b845c1f551",
        "b2c688a5-d2eb-45f0-8152-511e7ce7a7d3"
      ]
    },
    "error_detail": null
  }
}