{
  "ingest_source": {
    "id": "871db811-db4b-446f-9061-12b4159f0681",
    "source_type": "evernote_html",
    "source_path": "/Users/tang/workbench/article-classifier/backups/2023年6月/德语1/Gespräch über ein Thema _Gruppenreisen_.html",
    "collected_at": "2025-11-09T20:05:17.914065Z",
    "external_id": null,
    "title_hint": null,
    "language_hint": "de",
    "captured_at": null,
    "checksum": "0e847b44352f75db93e0f3931f4323b2d3b8a11febb414205b16e0dbc56415bf",
    "status": "pending",
    "notes": {
      "batch_id": null
    }
  },
  "note": {
    "id": "25963351-59d0-45d0-ae9d-5ec3a59b5bf7",
    "ingest_source_id": "871db811-db4b-446f-9061-12b4159f0681",
    "canonical_title": "Gespräch über ein Thema _Gruppenreisen_",
    "language": "de",
    "ingested_at": "2025-11-09T20:05:17.914071Z",
    "created_at": null,
    "status": "active",
    "importance": 0,
    "attributes": {
      "source_filename": "Gespräch über ein Thema _Gruppenreisen_.html"
    }
  },
  "variants": [
    {
      "id": "e0cb84e9-5ca9-4705-857e-b80e9db93fd8",
      "note_id": "25963351-59d0-45d0-ae9d-5ec3a59b5bf7",
      "variant_type": "raw_html",
      "version": 1,
      "created_by": "evernote_ingest:v0",
      "created_at": "2025-11-09T20:05:17.914074Z",
      "content": "---\ntitle: Gespräch über ein Thema \"Gruppenreisen\"\nupdated: 2020-12-02 12:05:17Z\ncreated: 2020-12-01 12:14:52Z\nauthor: tangyongfeng@gmail.com\ntags:\n  - B1\n  - 考前冲刺\n---\n\n\n<en-note><div>Sabine Kostermann  ist 33 Jahre alt. Sie ist B&uuml;rokauffrau.</div><div><br/></div><div>Sie ist der Meinung, dass sie gern in einer Gruppe&nbsp;reist. Allein reisen macht ihr keinen Spa&szlig;. Bei Gruppenreisen kann man neue Leute kennenlernen und hat immer Gesellschaft. Au&szlig;erdem ist ein Reisef&uuml;hrer dabei, der einem die Sehensw&uuml;rdigkeiten zeigt.\n</div><div><br/></div><div>Ich bin nicht ihrer Meinung. Ich liebe, allein zu reisen, weil  man immer ausschlafen kann. Wenn man in einer Gruppe reist, muss man oft fr&uuml;h aufstehen. Wenn ich allein reise, kann ich selbst einen passenden Plan machen. Ich denke, dass eine Reise frei und &nbsp;entspannt f&uuml;r mich sein soll . Wenn man mit einer Gruppe zusammen an einer Reise teilnimmt , dann man immer keine Zeit f&uuml;r sich. \n</div><div><br/></div><div>Lassen Sie mich meine Erfahrungen teilen. 2008 habe ich im Internet ein g&uuml;nstiges Flugticket nach Seattle gefunden. Das Ticket kostete ca. 400 Euro , dann habe ich spontan gebucht. Wenn ich die Abreise wusste habe, ist es erste &nbsp;Flug nach Seattle von der Fluglinie, das fangt eine Gluck an. </div><div><br/></div><div>Im Flugzeug habe ich viele &Uuml;berraschungen erlebt, z.B. im Flugzeug hat die Stewardess sehr sch&ouml;ne Lieder f&uuml;r uns gesungen, und als G&auml;ste haben wir viele Geschenke jede<span STYLE=\"text-decoration: line-through;\"> </span>Stunden bekomm. Eine besondere &Uuml;berraschung war die Eintrittskarte  f&uuml;r ein NBA Spiel. Nat&uuml;rlich bin ich auch NBA Fan. Ich wollte auch dieser super Chance bekommen, aber leider habe ich  sie nicht bekommen. Nach 12 Stunden ist das Flugzeugen auf dem Seattle Flughafen gelandet.\n</div><div><br/></div><div>Als das Flugzeug gelandet ist, hat der Flughafen einen Regenbogen mit Wasserwerfer gemacht, weil es die erste Ankunft der Fluglinie war.</div><div><br/></div><div>Am n&auml;chsten Tag habe ich das Boeing Museum besucht , es ist riesig . \n</div><div><br/></div><div>Ich interessiere mich f&uuml;r Flugzeuge seit 20 Jahren. Im diesem Boeing Museum  sind&nbsp; viele echte Flugzeuge, aber auch  Modelle ausgestellt.\n</div><div><br/></div><div> Es gibt die h&ouml;chsten  &quot;Blackbird&quot;, die &auml;ltesten und neuesten Flugzeugmodelle und im Boeing Museum habe ich unerwartet eine echte F14 und &nbsp;F18 gesehen. Ich kann sogar in den F18 sitzen ! Das  war ein Gl&uuml;ck f&uuml;r mich, weil man beide Flugzeugen nur selten im Museum besichtigen kann.\n</div><div><br/></div><div>Ich interessiere mich sehr f&uuml;r Flugzeuge. Mein Plan war es, dass dieses Museum f&uuml;r eine Tage zu besuch, aber dieses Museum war wirklich toll ,  deshalb habe ich meine Plan &nbsp;kurzfristig ge&auml;ndert und das Museum &uuml;ber drei Tage besucht. es  w&auml;re unm&ouml;glich gewesen, meinen Plan kurzfristig zu &auml;ndern, wenn ich mit eine Gruppe gereist w&auml;re.\n</div><div><br/></div><div>W&auml;hrend dieser Reise erlebte ich die USA mit &ouml;ffentlichen Verkehrsmitteln, weil ich  bei dieser Reise oft mit dem Bus von Hotel  in die Stadt gefahren  bin. Das Busticket  war nicht teuer, aber der Busfahrer meldete keine Station,  man konnte  immer Station  verpassen. Aber das  war keine Problem, wenn ich eine Station  verpasset hatte, dann  konnte ich einen neuen Ort besuchen. \n</div><div><br/></div><div>Das w&auml;re ich alleine Reise, hat mir viel<span STYLE=\"text-decoration: line-through;\">e</span> Spa&szlig; gemacht. Bis heute finde ich auch sehr Gl&uuml;ck von diese Reise.\n</div><div>Das ist wichtig, wenn man  bei der Reise etwas sehen oder, was man entscheiden oder wie lange man an eine Ort bleibe kann.</div></en-note>      ",
      "content_path": null,
      "diff_base_variant_id": null,
      "metadata": {
        "checksum": "0e847b44352f75db93e0f3931f4323b2d3b8a11febb414205b16e0dbc56415bf",
        "path": "/Users/tang/workbench/article-classifier/backups/2023年6月/德语1/Gespräch über ein Thema _Gruppenreisen_.html"
      }
    },
    {
      "id": "cd4a28ef-c509-4531-8954-98835545fd7e",
      "note_id": "25963351-59d0-45d0-ae9d-5ec3a59b5bf7",
      "variant_type": "clean_text",
      "version": 1,
      "created_by": "evernote_ingest:v0",
      "created_at": "2025-11-09T20:05:17.914077Z",
      "content": "---\ntitle: Gespräch über ein Thema \"Gruppenreisen\"\nupdated: 2020-12-02 12:05:17Z\ncreated: 2020-12-01 12:14:52Z\nauthor: tangyongfeng@gmail.com\ntags:\n  - B1\n  - 考前冲刺\n---\n\nSabine Kostermann  ist 33 Jahre alt. Sie ist Bürokauffrau.\nSie ist der Meinung, dass sie gern in einer Gruppe reist. Allein reisen macht ihr keinen Spaß. Bei Gruppenreisen kann man neue Leute kennenlernen und hat immer Gesellschaft. Außerdem ist ein Reiseführer dabei, der einem die Sehenswürdigkeiten zeigt.\n\nIch bin nicht ihrer Meinung. Ich liebe, allein zu reisen, weil  man immer ausschlafen kann. Wenn man in einer Gruppe reist, muss man oft früh aufstehen. Wenn ich allein reise, kann ich selbst einen passenden Plan machen. Ich denke, dass eine Reise frei und  entspannt für mich sein soll . Wenn man mit einer Gruppe zusammen an einer Reise teilnimmt , dann man immer keine Zeit für sich.\n\nLassen Sie mich meine Erfahrungen teilen. 2008 habe ich im Internet ein günstiges Flugticket nach Seattle gefunden. Das Ticket kostete ca. 400 Euro , dann habe ich spontan gebucht. Wenn ich die Abreise wusste habe, ist es erste  Flug nach Seattle von der Fluglinie, das fangt eine Gluck an.\nIm Flugzeug habe ich viele Überraschungen erlebt, z.B. im Flugzeug hat die Stewardess sehr schöne Lieder für uns gesungen, und als Gäste haben wir viele Geschenke jede\n\nStunden bekomm. Eine besondere Überraschung war die Eintrittskarte  für ein NBA Spiel. Natürlich bin ich auch NBA Fan. Ich wollte auch dieser super Chance bekommen, aber leider habe ich  sie nicht bekommen. Nach 12 Stunden ist das Flugzeugen auf dem Seattle Flughafen gelandet.\n\nAls das Flugzeug gelandet ist, hat der Flughafen einen Regenbogen mit Wasserwerfer gemacht, weil es die erste Ankunft der Fluglinie war.\nAm nächsten Tag habe ich das Boeing Museum besucht , es ist riesig .\n\nIch interessiere mich für Flugzeuge seit 20 Jahren. Im diesem Boeing Museum  sind  viele echte Flugzeuge, aber auch  Modelle ausgestellt.\n\n Es gibt die höchsten  \"Blackbird\", die ältesten und neuesten Flugzeugmodelle und im Boeing Museum habe ich unerwartet eine echte F14 und  F18 gesehen. Ich kann sogar in den F18 sitzen ! Das  war ein Glück für mich, weil man beide Flugzeugen nur selten im Museum besichtigen kann.\n\nIch interessiere mich sehr für Flugzeuge. Mein Plan war es, dass dieses Museum für eine Tage zu besuch, aber dieses Museum war wirklich toll ,  deshalb habe ich meine Plan  kurzfristig geändert und das Museum über drei Tage besucht. es  wäre unmöglich gewesen, meinen Plan kurzfristig zu ändern, wenn ich mit eine Gruppe gereist wäre.\n\nWährend dieser Reise erlebte ich die USA mit öffentlichen Verkehrsmitteln, weil ich  bei dieser Reise oft mit dem Bus von Hotel  in die Stadt gefahren  bin. Das Busticket  war nicht teuer, aber der Busfahrer meldete keine Station,  man konnte  immer Station  verpassen. Aber das  war keine Problem, wenn ich eine Station  verpasset hatte, dann  konnte ich einen neuen Ort besuchen.\n\nDas wäre ich alleine Reise, hat mir viel\ne\n Spaß gemacht. Bis heute finde ich auch sehr Glück von diese Reise.\n\nDas ist wichtig, wenn man  bei der Reise etwas sehen oder, was man entscheiden oder wie lange man an eine Ort bleibe kann.",
      "content_path": null,
      "diff_base_variant_id": null,
      "metadata": {
        "language": "de",
        "length": 3187,
        "rule_count": 1,
        "applied_rules": [
          {
            "rule_id": "whitespace",
            "description": "Normalize whitespace",
            "note": "collapsed whitespace"
          }
        ]
      }
    }
  ],
  "extractions": [],
  "journal": {
    "id": "fff0fb2f-e3be-4040-8aef-0581fd02cbb8",
    "note_id": "25963351-59d0-45d0-ae9d-5ec3a59b5bf7",
    "stage": "ingest",
    "agent_id": "evernote_ingest:v0",
    "started_at": "2025-11-09T20:05:17.914083Z",
    "finished_at": "2025-11-09T20:05:17.914083Z",
    "status": "success",
    "input_ref": {
      "task_id": "58b484ed-178a-4e7a-b806-be252b91e580",
      "source_path": "/Users/tang/workbench/article-classifier/backups/2023年6月/德语1/Gespräch über ein Thema _Gruppenreisen_.html",
      "checksum": "0e847b44352f75db93e0f3931f4323b2d3b8a11febb414205b16e0dbc56415bf"
    },
    "output_ref": {
      "ingest_source": "871db811-db4b-446f-9061-12b4159f0681",
      "note": "25963351-59d0-45d0-ae9d-5ec3a59b5bf7",
      "variants": [
        "e0cb84e9-5ca9-4705-857e-b80e9db93fd8",
        "cd4a28ef-c509-4531-8954-98835545fd7e"
      ]
    },
    "error_detail": null
  }
}